VGG 16: | 18 layers [1,2,4,5,7,8,9,11,12,13,15,16,17]
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_11 (InputLayer)        (None, None, None, 3)     0
_________________________________________________________________
block1_conv1 (Conv2D)        (None, None, None, 64)    1792
_________________________________________________________________
block1_conv2 (Conv2D)        (None, None, None, 64)    36928
_________________________________________________________________
block1_pool (AveragePooling2 (None, None, None, 64)    0
_________________________________________________________________
block2_conv1 (Conv2D)        (None, None, None, 128)   73856
_________________________________________________________________
block2_conv2 (Conv2D)        (None, None, None, 128)   147584
_________________________________________________________________
block2_pool (AveragePooling2 (None, None, None, 128)   0
_________________________________________________________________
block3_conv1 (Conv2D)        (None, None, None, 256)   295168
_________________________________________________________________
block3_conv2 (Conv2D)        (None, None, None, 256)   590080
_________________________________________________________________
block3_conv3 (Conv2D)        (None, None, None, 256)   590080
_________________________________________________________________
block3_pool (AveragePooling2 (None, None, None, 256)   0
_________________________________________________________________
block4_conv1 (Conv2D)        (None, None, None, 512)   1180160
_________________________________________________________________
block4_conv2 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
block4_conv3 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
block4_pool (AveragePooling2 (None, None, None, 512)   0
_________________________________________________________________
block5_conv1 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
block5_conv2 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
block5_conv3 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
block5_pool (AveragePooling2 (None, None, None, 512)   0
=================================================================
Total params: 14,714,688
Trainable params: 14,714,688
Non-trainable params: 0
_________________________________________________________________

VGG 19:
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
0 input_35 (InputLayer)        (None, None, None, 3)     0
_________________________________________________________________
1 block1_conv1 (Conv2D)        (None, None, None, 64)    1792
_________________________________________________________________
2 block1_conv2 (Conv2D)        (None, None, None, 64)    36928
_________________________________________________________________
3 block1_pool (AveragePooling2 (None, None, None, 64)    0
_________________________________________________________________
4 block2_conv1 (Conv2D)        (None, None, None, 128)   73856
_________________________________________________________________
5 block2_conv2 (Conv2D)        (None, None, None, 128)   147584
_________________________________________________________________
6 block2_pool (AveragePooling2 (None, None, None, 128)   0
_________________________________________________________________
7 block3_conv1 (Conv2D)        (None, None, None, 256)   295168
_________________________________________________________________
8 block3_conv2 (Conv2D)        (None, None, None, 256)   590080
_________________________________________________________________
9 block3_conv3 (Conv2D)        (None, None, None, 256)   590080
_________________________________________________________________
10 block3_conv4 (Conv2D)        (None, None, None, 256)   590080
_________________________________________________________________
11 block3_pool (AveragePooling2 (None, None, None, 256)   0
_________________________________________________________________
12 block4_conv1 (Conv2D)        (None, None, None, 512)   1180160
_________________________________________________________________
13 block4_conv2 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
14 block4_conv3 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
15 block4_conv4 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
16 block4_pool (AveragePooling2 (None, None, None, 512)   0
_________________________________________________________________
17 block5_conv1 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
18 block5_conv2 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
19 block5_conv3 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
20 block5_conv4 (Conv2D)        (None, None, None, 512)   2359808
_________________________________________________________________
21 block5_pool (AveragePooling2 (None, None, None, 512)   0
=================================================================
Total params: 20,024,384
Trainable params: 20,024,384
Non-trainable params: 0
_________________________________________________________________
